[
  {
    "foodName": "Mutton Curry with Potatoes",
    "foodPicture": "https://www.thebangladeshikitchen.com/wp-content/uploads/2020/02/khasir-mangsho-alu-diye-mutton-curry-800x475.jpg",
    "foodIngredient": [
      "1 kg Mutton",
      "4 pcs Potato",
      "1/2 cup Chopped onion",
      "1 tsp each Ginger-garlic paste",
      "1 tsp Cumin powder",
      "1 tbsp Red chili powder",
      "1/2 tsp Mace-nutmeg paate",
      "1 tsp Papaya paste",
      "1 tsp Turmeric powder",
      "As required Roasted spices powder (Cinnamon, cardamom & cumin)",
      "1/2 cup Vegetable/soybean oil",
      "To taste Salt",
      "2 pcs Bay leaves",
      "4 pcs Cloves",
      "1/2 tsp each Cinnamon-cardamom powders"
    ],
    "foodCategory": "Main dish",
    "foodInstruction": "1. Cut the meat into small pieces, wash and drain properly. 2. Wash and drain potatoes. Mix with some salt and a pinch of turmeric powder or alternatively saffron powder for color. 3. Now heat oil in a pan. Deep fry the potatoes till brown. Strain the potatoes to remove extra oil and set aside. 4. Now in the same oil add chopped onions, bay leaves, cloves and cook for a minute to make onions tender. No need to fry onions to brown. Add garlic and ginger pastes and stir for a while. Now add cumin powder, red chili powder, cinnamon powder, cardamom powder and some water. Mix and cook well till the spices release oil. Now add meat pieces and mix them properly. No need to add water in this stage since meat releases water. Cook for 5 minutes. 5. When the spices mix gets thick and oil separates, add mace-nutmeg pastes, papaya paste and give a nice mix. Add water and cover with the lid. Cook for 20 minutes. You can add extra water in this stage and cook for extra 5 minutes if the meat is still hard. When water is reduced to half, add turmeric powder and cook for 2 to 3 minutes. 6. Then add water as per your gravy requirement and cook with the lid. While boiling add the potatoes, again close the lid and cook for 15 to 20 minutes. When the gravy is dried to your requirement, turn the heat off and sprinkle some roasted cardamom, cumin and cinnamon powder mix. Serve warm with plain or pulao/pilaf rice, roti, paratha or naan bread.",
    "foodId": 1
  },
  {
    "foodName": "Homestyle Chicken Korma",
    "foodPicture": "https://www.thebangladeshikitchen.com/wp-content/uploads/2017/05/Homestyle-Chicken-Korma.png",
    "foodIngredient": [
      "2 pounds bone-in chicken (dark meat best)",
      "2 medium onions,  peeled",
      "1.5  inch of ginger, chopped",
      "4 cloves garlic, chopped",
      "½ cup whole-milk yogurt",
      "4 to 6 green cardamom pods",
      "3 to 5 cloves",
      "2 whole bay leaves",
      "1 3-in stick cinnamon",
      "2 tsp salt",
      "½ tsp sugar",
      "1 teaspoon black peppercorns",
      "2 to 3 small hot green peppers",
      "4 tbsp of ghee"
    ],
    "foodCategory": "Main dish",
    "foodInstruction": "Thinly slice one onion and set aside. Roughly chop the other onion, and then puree it in a blender with the garlic and ginger until smooth. Add water if necessary. Combine the puree, chicken, yogurt, cardamom, cinnamon, peppercorns, and bay leaves in a covered Dutch oven and simmer over medium-high heat, stirring occasionally for 10-15 minutes. Uncover and bring the pot to a low simmer. Cook until chicken is tender. Flip occasionally. 20-35 minutes. Add in the sliced chilis and sugar and stir. Adjust the thickness of the gravy by adding water or cooking it down. Heat the ghee and the thinly sliced onions in a pan over medium heat until they are a rich brown. 5-7 minutes. Season the onions with a pinch of salt and stir it into the korma.",
    "foodId": 2
  },
  {
    "foodName": "Spicy Dry Chicken – Kosha Murgir Mangsho",
    "foodPicture": "https://www.thebangladeshikitchen.com/wp-content/uploads/2014/10/KushaMurgi.png",
    "foodIngredient": [
      "Chicken 100 grams. A whole chicken cut up into 8-10 pieces will work gret",
      "1/2 cup mustard oil",
      "4 bay leaves",
      "4-6 dried red chilies",
      "4 whole green cardamom",
      "2 tbsp sugar",
      "2 cups chopped/sliced onions",
      "2 medium onions for paste",
      "4 cloves of garlic for paste",
      "1 one inch stick of ginger for paste",
      "4 tomatoes, chopped (or an 16 ounce can of chopped tomatoes will do)",
      "2 tsp of salt",
      "2 tbsp coriander powder",
      "1 tsp turmeric powder",
      "1 tsp roasted cumin powder",
      "1 tsp cayenne pepper powder",
      "1 tsp garam masalla",
      "1-2 tbsp cilantro, finely chopped"
    ],
    "foodCategory": "Main dish",
    "foodInstruction": "Heat the mustard oil in a deep wok or saucepan over medium/medium-high heat. When hot,  add the cardamom pods, bay leaves, dried red chili, and then sugar and stir for a minute. Add the sliced/chopped onions and saute until they are golden and caramelized. Meanwhile blend garlic, ginger, and onion to make a paste and add it to the caramelized onions. Saute 3-4 minutes and then add in the chicken. Stir the chicken in the oil for 2 minutes until the chicken is uniformly coated with the spices. Add the turmeric powder and saute an additional 5-6 minutes. Add salt and stir. Keep sauteing until the chicken surface or the skin starts turning a bit brown. Now add the coriander powder, red chili powder, and cumin powder. Stir in the spices well and saute for 2-3 minutes. Add the chopped tomatoes and further saute for 5-8 minutes. Keep frying until the tomatoes are completely incorporated.If the spices start sticking to the pot, add a tablespoon of water or more to deglaze but keep in mind as to keep the dish just moist and not waterlogged. Add the garam masala powder and saute for further 2 minutes. Remove from flame, garnish with cilantro and cover the chicken. Serve warm with paratha, ruti, or plain white rice.",
    "foodId": 3
  },
  {
    "foodName": "Stirfried Cabbage with Garlic and Bengali Spices",
    "foodPicture": "https://www.thebangladeshikitchen.com/wp-content/uploads/2014/10/garliccabbage.png",
    "foodIngredient": [
      "1/2 head of cabbage shredded thinly",
      "2 tbsp ghee",
      "1-2 dried red chili",
      "4-6 cloves garlic, chopped",
      "1/2 tsp black mustard seeds",
      "1/2 tsp nigella (black cumin seeds)",
      "1/2 tsp cumin seeds",
      "1 tsp of salt",
      "Fresh back pepper to taste"
    ],
    "foodCategory": "Main dish",
    "foodInstruction": "Heat the ghee  in a wok or large skillet over medium-high heat. Add in the dried chili and the three spices ans stir until the spices start crackling. After they begin to crackle, add the fresh garlic and saute until the garlic turns a rich golden color and looks almost caramelized. Add in the cabbage and stir until all the cabbage is coated evenly with the ghee and spices. Add in the salt and stir until the cabbage is again evenly coated. Keep stirring for 5 minutes until the cabbage is wilted. Turn down the heat to low and cook covered another 10-15 minutes, stirring occasionally. Add crushed pepper just before serving",
    "foodId": 4
  },
  {
    "foodName": "Kata Moshlar Mangsho – Meat with whole spices",
    "foodPicture": "https://www.thebangladeshikitchen.com/wp-content/uploads/2014/10/KataMoshlarMangsho.png",
    "foodIngredient": [
      "1 kg beef, cubed",
      "1 large onion thinky sliced",
      "1 tbsp ginger, julienned",
      "1 tbsp garlic, chopped",
      "6-8 dry red chilies",
      "3 cardamom",
      "1″ cinnamon stick",
      "1 bay leaf",
      "6-7 black pepper",
      "4-5 clove",
      "2 tablespoon vinegar",
      "½ cup yogurt",
      "½ cup oil or ghee",
      "Salt to taste (1 to 1 ½ tsp)"
    ],
    "foodCategory": "Main dish",
    "foodInstruction": "Marinate the meat with vinegar for at least 30 minutes. Heat up the oil in a dutch oven over medium heat. Add the beef and all the other ingredients except for the yogurt. Saute for 10-15 minutes until the onions are translucent. Add the yogurt and 1-2 cups of water. Cook over medium heat until done (45 minutes to 1 hour). Or preheat an oven to 175 degrees Celsius and bake covered for about 1 hour",
    "foodId": 5
  },
  {
    "foodName": "Bhuna Khichuri",
    "foodPicture": "https://www.thebangladeshikitchen.com/wp-content/uploads/2014/10/BhunaKhichuri.png",
    "foodIngredient": [
      "MoogdAl 1 cup",
      "PolAu Rice  2 cups",
      "Finely diced ginger 2 tsp",
      "Salt 1 tbsp",
      "Cinnamon Sticks 2/3",
      "Bayleaf 2 [small ones]",
      "Ghee 1/2 cup",
      "Cloves 4/5"
    ],
    "foodCategory": "Rice, Lentils and daal",
    "foodInstruction": "Wash the rice. Fry the dAl separtely for a while. Lightly fry in ghee the ginger and bay leaves. Then add the rice, dAl, and salt, fry for about 10 minutes. Medium to medium high heat. Add five cups of boiling water and the salt. As soon as the water comes up to boil, put a lid on it. 🙂Simmer in low heat for 20/25 minutes. You could add beresta to it or you could make it spicier by adding turmeric and chilli powder. I use 1/2 tsp of the former and 1 tsp of the latter. [I like it hot]",
    "foodId": 6
  },
  {
    "foodName": "Begun Bhaji – Fried Eggplant – 1",
    "foodPicture": "https://www.thebangladeshikitchen.com/wp-content/uploads/2010/02/begunbhaji.jpg",
    "foodIngredient": [
      "One large egg plant sliced 1/4 inch thick",
      "1 tsp turmeric powder",
      "1 tsp cumin powder",
      "1/2 tsp cayenne chili powder",
      "1/2 tsp garlic powder",
      "1 tsp salt",
      "1/4 tsp garam masalla",
      "3 tbsp olive or mustard oil. The latter gives it an interesting (and tastey) pungency.",
      "Additional oil to for frying"
    ],
    "foodCategory": "Side dishes",
    "foodInstruction": "Mix all the spices with the oil. Cover both sides of the sliced egg-plant and set aside. Put a thin layer of oil on a frying pan over high heat. As soon as the oil appears to start smoking, put a single layer of eggplant into the pan (as much as can fit). Turn down the heat and saute until almost cooked but not burned (5-7 minutes). Flip and saute the other side. You might need to add a little bit more oil and turn up the heat. Repeat until all the slices are cooked",
    "foodId": 7
  }
]
